# YOLO26n + ShuffleNetV2 backbone, face detection + 5-point landmark (pose) — SLIM2 variant.
# = SLIM bớt thêm 1 ShuffleV2Block s=1 ở P5 stage (thí nghiệm A/B theo vòng khoanh L11):
#   1. Bỏ C2PSA (-63K) — giữ SPPF.                                (như slim)
#   2. Slim nhánh P5 neck: C3k2 cuối 512→384 + bỏ attn (ra 96ch). (như slim)
#   3. P5 stage: s2 + 1×s1 (bỏ 1 block s1, -9.2K params).         (MỚI ở slim2)
#   4. GIỮ L7 (P4 stage 4 block nguyên) — P4 gánh recall mặt trung, không đụng.
# Kỳ vọng ~521.7K params (-1.7% so với slim). Mọi index đã đánh lại (24 layer cuối là Pose26).

nc: 1
end2end: True
reg_max: 1
kpt_shape: [5, 3]   # 5 landmark khuôn mặt (2 mắt, mũi, 2 khoé miệng); mỗi điểm (x, y, visible)

scales:
  n: [0.50, 0.25, 1024]

# Backbone outputs:
# layer 4  = P3/8
# layer 8  = P4/16
# layer 11 = P5/32 (SPPF)
backbone:
  # [from, repeats, module, args]

  # Stem
  - [-1, 1, Conv, [32, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]              # 1-P2/4

  # P3 stage
  - [-1, 1, ShuffleV2Block, [128, 2]]      # 2-P3/8
  - [-1, 1, ShuffleV2Block, [128, 1]]      # 3
  - [-1, 1, ShuffleV2Block, [128, 1]]      # 4-P3/8

  # P4 stage (giữ nguyên 4 block)
  - [-1, 1, ShuffleV2Block, [256, 2]]      # 5-P4/16
  - [-1, 1, ShuffleV2Block, [256, 1]]      # 6
  - [-1, 1, ShuffleV2Block, [256, 1]]      # 7
  - [-1, 1, ShuffleV2Block, [256, 1]]      # 8-P4/16

  # P5 stage (slim2: chỉ còn s2 + 1×s1)
  - [-1, 1, ShuffleV2Block, [512, 2]]      # 9-P5/32
  - [-1, 1, ShuffleV2Block, [512, 1]]      # 10
  - [-1, 1, SimSPPF, [512, 5, 3, True]]    # 11-P5/32  (slim2: SimSPPF — ReLU thay SiLU, INT8-friendly)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 8], 1, Concat, [1]]                    # 13 cat P4
  - [-1, 2, C3k2, [256, True]]                   # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16 cat P3
  - [-1, 2, C3k2, [128, True]]                   # 17 P3/8-small

  - [-1, 1, Conv, [128, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19 cat P4
  - [-1, 2, C3k2, [256, True]]                   # 20 P4/16-medium

  - [-1, 1, Conv, [256, 3, 2]]                   # 21
  - [[-1, 11], 1, Concat, [1]]                   # 22 cat P5 (SPPF out)
  - [-1, 1, C3k2, [384, True, 0.5]]              # 23 P5/32-large  (slim: 512→384, bỏ attn)

  - [[17, 20, 23], 1, Pose26, [nc, kpt_shape]]   # 24 Pose26(P3, P4, P5)
