# YOLO26n + RepViT-style backbone for face detection
# Backbone is replaced, YOLO26 detection head is preserved.

nc: 1
end2end: True
reg_max: 1

scales:
  n: [0.50, 0.25, 1024]

# Backbone outputs:
# layer 4  = P3/8
# layer 8  = P4/16
# layer 13 = P5/32
backbone:
  # [from, repeats, module, args]

  # Stem
  - [-1, 1, Conv, [32, 3, 2]]                  # 0-P1/2
  - [-1, 1, Conv, [64, 3, 2]]                  # 1-P2/4

  # P3 stage
  - [-1, 1, RepViTBlock, [128, 2, 2.0, false]] # 2-P3/8
  - [-1, 1, RepViTBlock, [128, 1, 2.0, false]] # 3
  - [-1, 1, RepViTBlock, [128, 1, 2.0, false]] # 4-P3/8

  # P4 stage
  - [-1, 1, RepViTBlock, [256, 2, 2.0, false]] # 5-P4/16
  - [-1, 1, RepViTBlock, [256, 1, 2.0, false]] # 6
  - [-1, 1, RepViTBlock, [256, 1, 2.0, true]]  # 7
  - [-1, 1, RepViTBlock, [256, 1, 2.0, true]]  # 8-P4/16

  # P5 stage
  - [-1, 1, RepViTBlock, [512, 2, 2.0, true]]  # 9-P5/32
  - [-1, 1, RepViTBlock, [512, 1, 2.0, true]]  # 10
  - [-1, 1, RepViTBlock, [512, 1, 2.0, true]]  # 11
  - [-1, 1, SPPF, [512, 5, 3, True]]           # 12
  - [-1, 1, C2PSA, [512]]                      # 13-P5/32

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 8], 1, Concat, [1]]                  # 15 cat P4
  - [-1, 2, C3k2, [256, True]]                 # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 4], 1, Concat, [1]]                  # 18 cat P3
  - [-1, 2, C3k2, [128, True]]                 # 19 P3/8-small

  - [-1, 1, Conv, [128, 3, 2]]                 # 20
  - [[-1, 16], 1, Concat, [1]]                 # 21 cat P4
  - [-1, 2, C3k2, [256, True]]                 # 22 P4/16-medium

  - [-1, 1, Conv, [256, 3, 2]]                 # 23
  - [[-1, 13], 1, Concat, [1]]                 # 24 cat P5
  - [-1, 1, C3k2, [512, True, 0.5, True]]      # 25 P5/32-large

  - [[19, 22, 25], 1, Detect, [nc]]            # 26 Detect(P3, P4, P5)